---
title: 網路基礎及Vlan複習
date: 2018-02-26 15:27:31
categories:
- 課堂學習
tags:
- CCNA
- VLSM
- Switch
thumbnail: https://cdn.pixabay.com/photo/2012/04/01/12/54/computer-23328_960_720.png
---

## 子網遮罩計算

![](https://i.imgur.com/7IvsLUf.png)

### 狀況A - PC0為第一個可用IP，兩者遮罩相同，求PC1的IP

PC0為192.168.1.1/29故得：
* PC0的IP：192.168.1.1
* PC0的子網遮罩：255.255.255.248
    1. 255.255.255.0為/24
    2. /29會多借走5個bit則剩下3個bit
    3. 則2的3次方為8，2的8次方為256
    4. 256-8(剩下的)=248(遮罩)

透過PC0推導PC1：
* PC0的IP最後一碼為1且遮罩後該網段所有IP為8個
* 8個扣除第一個IP為**網路位址**及最後一個IP為**廣播位址**
* 可得知可用IP共6個分別為1、2、3、4、5、6
* PC1為最後一個可用IP則為192.168.1.6

### 狀況B - PC0為其中一個可用IP，兩者遮罩相同，求PC1的IP

PC0為192.168.1.10/29故得：
* PC0的IP：192.168.1.10
* PC0的子網遮罩：255.255.255.248
    1. 255.255.255.0為/24
    2. /29會多借走5個bit則剩下3個bit
    3. 則2的3次方為8，2的8次方為256
    4. 256-8(剩下的)=248(遮罩)

透過PC0推導PC1：
* PC0的IP最後一碼為10且遮罩後該網段所有IP為8個
* 從0-7開始每8個唯一組判斷，10應該落在8-15之間
* 8個扣除第一個IP為**網路位址**及最後一個IP為**廣播位址**
* 可得知可用IP共6個分別為9、10、11、12、13、14
* PC1為最後一個可用IP則為192.168.1.14

## 封包觀察

**交換器**工作於**layer 2**故查看時只會看見來源及目的的**Mac**
**路由器**工作於**layer 3**故查看時會看見來源及目的的**Mac跟IP**
**ICMP送出去的Type為8**，目的端成功接收到後會返回，此時可知**返回的Type會改為0**

## 交換器操作(Vlan)

### 狀況A - 一台交換器多個Vlan

![](https://i.imgur.com/LUtHpFz.png)

於Switch0中輸入下列指令
可以發現預設已經建立五個vlan

```
Switch>enable
Switch#configure terminal
Switch(config)#do show vlan
```

---

輸入下列指令會先創立一個vlan15
再將它命名為abc

```
Switch(config)#vlan 15
Switch(config-vlan)#name abc
```

---

輸入下列指令會先進入fa0/1的設定內
再將該port改放入vlan15中(預設在valn1)
最後可以看見已搬移至vlan15中

```
Switch(config-vlan)#int fa0/1
Switch(config-if)#switchport access vlan 15
Switch(config-if)#do show vlan
```

### 狀況B - 多台交換器多個Vlan(同valn連線)

![](https://i.imgur.com/X5ibcqi.png)

Switch0輸入下列指令
延續狀況A先建立vlan15並將fa0/1搬入
為了可以跨交換器同valn連線
則必須將兩台交換器之間的連線也放入vlan15中(fa2/1)

```
Switch>enable
Switch#configure terminal
Switch(config)#vlan 15
Switch(config-vlan)#int fa0/1
Switch(config-if)#switchport access vlan 15
Switch(config-if)#int fa2/1
Switch(config-if)#switchport access vlan 15
```

---

Switch1輸入下列指令
為了可以跟Switch0的PC0連線
則此時PC2必須設定為相同網段之IP
且在Switch1將fa1/1放入vlan15中
並將兩台交換器連線也放入vlan15(fa0/1)之中

```
Switch>enable
Switch#configure terminal
Switch(config)#vlan 15
Switch(config-vlan)#int fa1/1
Switch(config-if)#switchport access vlan 15
Switch(config-if)#int fa0/1
Switch(config-if)#switchport access vlan 15
```

---

透過上述練習可以發現
每一個vlan要跨交換器連線則需要一條實體網路連線
如此會造成相當大的問題(過多網路線甚至不夠用)
因此可以改採用Trunk的方式來解決

---

接續前面內容直接在Switch0輸入下列指令
會將fa0/1設定為trunk
如此會讓所有vlan能透過此通道進行跨交換器連線

```
Switch(config-if)#int fa0/1
Switch(config-if)#switchport mode trunk
```

---

同理也需要在Switch1輸入下列指令即可完成

```
Switch(config-if)#int fa2/1
Switch(config-if)#switchport mode trunk
```